# Aggregation Function in pandas

In [36]:
import pandas as pd

# Sample data dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 45, 14],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, 60000, 70000, 80000],
    'Perfomance Score': [78, None, 90, 80]
}

# Convert the dictionary into two DataFrames
df1 = pd.DataFrame(data)
df1

      Name  Age         City  Salary  Perfomance Score
0    Alice   25     New York   50000              78.0
1      Bob   30  Los Angeles   60000               NaN
2  Charlie   45      Chicago   70000              90.0
3    David   14      Houston   80000              80.0

In [37]:
df1.agg({'Age': ['mean', 'min', 'max'], 'Salary': ['sum', 'mean']})

       Age    Salary
mean  28.5   65000.0
min   14.0       NaN
max   45.0       NaN
sum    NaN  260000.0

# summary Statictics

In [19]:
import pandas as pd
import numpy as np  # Import NumPy for NaN handling

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, None, 40],  # None is present
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, None, 70000, 80000],
    'Perfomance Score': [78, None, 90, 80]
}

# Convert to DataFrame
df1 = pd.DataFrame(data)

# Convert 'None' to NaN (important for calculations)
df1['Age'] = df1['Age'].astype(float)

# Now calculate the mean
df2 = df1['Age'].mean()
print(df2)  # Expected output: 31.67

31.666666666666668

In [20]:
# Convert 'None' to NaN (important for calculations)
df1['Salary'] = df1['Salary'].astype(float)
df1 = df1['Salary'].mean()
df1

66666.66666666667

# Grouping

In [21]:
import pandas as pd

# Sample data dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 45, 14],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, 60000, 70000, 80000],
    'Perfomance Score': [78, None, 90, 80]
}

# Convert the dictionary into two DataFrames
df1 = pd.DataFrame(data)
df1

      Name  Age         City  Salary  Perfomance Score
0    Alice   25     New York   50000              78.0
1      Bob   30  Los Angeles   60000               NaN
2  Charlie   45      Chicago   70000              90.0
3    David   14      Houston   80000              80.0

In [24]:
# grouped = df1.groupby('Age' this is column parametrer )['Salary'].sum()
grouped = df1.groupby('Age')['Salary'].sum()
print(grouped)

Age
14    80000
25    50000
30    60000
45    70000
Name: Salary, dtype: int64

In [30]:
grouped = df1.groupby('Age')['Salary'].count()
print(grouped)
#  min()
#  max()
#  mean()
#  count()
#  avg()
#  std()

Age
14    1
25    1
30    1
45    1
Name: Salary, dtype: int64

# Muliple Column grouping -->

In [35]:
grouped = df1.groupby(['Age','Name'])['Salary'].sum()
print(grouped)

Age  Name
14   David      80000
25   Alice      50000
30   Bob        60000
45   Charlie    70000
Name: Salary, dtype: int64